In [2]:
import pandas as pd

In [3]:
df1 =  pd.DataFrame(
    {
        'id':[1,2,3],
        'name':['Alice', 'Bob', 'John']
    }
)

df2 = pd.DataFrame(
    {
        'id':[4,5,6],
        'name':['Jane', 'Adam', 'John']
    }
)

In [4]:
df1

   id   name
0   1  Alice
1   2    Bob
2   3   John

In [5]:
df2

   id  name
0   4  Jane
1   5  Adam
2   6  John

In [6]:
pd.concat([df1, df2])

   id   name
0   1  Alice
1   2    Bob
2   3   John
0   4   Jane
1   5   Adam
2   6   John

In [10]:
pd.concat([df1, df2], axis=1)
# print('done')
# pd.concat([df1, df2], axis=0)

   id   name  id  name
0   1  Alice   4  Jane
1   2    Bob   5  Adam
2   3   John   6  John

In [28]:
df1 =  pd.DataFrame(
    {
        'id':[1,2,3],
        'name':['Alice', 'Bob', 'John']
    }
)

df2 = pd.DataFrame(
    {
        'id':[1,2,6],
        'name':['Alice', 'Bob1', 'John'],
        'score':[50, 60, 70]
    }
)

In [21]:
df1

   id   name
0   1  Alice
1   2    Bob
2   3   John

In [29]:
df2

   id   name  score
0   1  Alice     50
1   2   Bob1     60
2   6   John     70

In [30]:
result = pd.merge(df1, df2, on='id')
result

   id name_x name_y  score
0   1  Alice  Alice     50
1   2    Bob   Bob1     60

In [31]:
result = pd.merge(df1, df2)
result

   id   name  score
0   1  Alice     50

In [32]:
result = pd.merge(df1, df2, on='id', suffixes=[None, '_other'])
result

   id   name name_other  score
0   1  Alice      Alice     50
1   2    Bob       Bob1     60

In [33]:
result = pd.merge(df1, df2, on='id', how='inner')
result

   id name_x name_y  score
0   1  Alice  Alice     50
1   2    Bob   Bob1     60

In [34]:
result = pd.merge(df1, df2, on='id', how='outer')
result

   id name_x name_y  score
0   1  Alice  Alice   50.0
1   2    Bob   Bob1   60.0
2   3   John    NaN    NaN
3   6    NaN   John   70.0

In [35]:
result = pd.merge(df1, df2, on='id', how='left')
result

   id name_x name_y  score
0   1  Alice  Alice   50.0
1   2    Bob   Bob1   60.0
2   3   John    NaN    NaN

In [36]:
result = pd.merge(df1, df2, on='id', how='right')
result

   id name_x name_y  score
0   1  Alice  Alice     50
1   2    Bob   Bob1     60
2   6    NaN   John     70

In [42]:
result.sort_values(by=['score'])

   id name_x name_y  score
0   1  Alice  Alice     50
1   2    Bob   Bob1     60
2   6    NaN   John     70

In [43]:
df1

   id   name
0   1  Alice
1   2    Bob
2   3   John

In [44]:
df2

   id   name  score
0   1  Alice     50
1   2   Bob1     60
2   6   John     70

In [45]:
res = pd.merge(df1, df2, on='id', how='left')
res

   id name_x name_y  score
0   1  Alice  Alice   50.0
1   2    Bob   Bob1   60.0
2   3   John    NaN    NaN

In [46]:
res['score'].isna()

0    False
1    False
2     True
Name: score, dtype: bool

In [47]:
res[res['score'].isna()]

   id name_x name_y  score
2   3   John    NaN    NaN

In [49]:
res[res['score'].isna()].drop(columns=['score'])

   id name_x name_y
2   3   John    NaN

**grouping**

In [72]:
data =  {
'Department': ['Hr', 'Hr', 'It', 'Finance', 'Finance', 'Finance'],
'Employee': ['Alice', 'Bob', 'Charlie', 'Josh','Ali', 'jOHN'],
'Salary': [5000,  6000, 7000, 8000, 10000, 20000]
}
df = pd.DataFrame(data)
df

  Department Employee  Salary
0         Hr    Alice    5000
1         Hr      Bob    6000
2         It  Charlie    7000
3    Finance     Josh    8000
4    Finance      Ali   10000
5    Finance     jOHN   20000

In [53]:
df.max()

Department       It
Employee       Josh
Salary        10000
dtype: object

In [54]:
df['Salary'].max()

np.int64(10000)

In [55]:
unique= df['Department'].drop_duplicates().tolist()
unique

['Hr', 'It', 'Finance']

In [56]:
for department in unique:
    filter = df[df['Department']==department]
    display(filter)
    print('-'*50)

  Department Employee  Salary
0         Hr    Alice    5000
1         Hr      Bob    6000

--------------------------------------------------

  Department Employee  Salary
2         It  Charlie    7000

--------------------------------------------------

  Department Employee  Salary
3    Finance     Josh    8000
4    Finance      Ali   10000

--------------------------------------------------

In [59]:
filter['Salary'].max()
print({department})

{'Finance'}

In [60]:
result = df.groupby('Department')
result

In [61]:
result.max()

           Employee  Salary
Department
Finance        Josh   10000
Hr              Bob    6000
It          Charlie    7000

In [66]:
max= df.groupby('Department')['Salary'].max()
min= df.groupby('Department')['Salary'].min()
pd.merge(max, min, left_index=True, right_index=True)

            Salary_x  Salary_y
Department
Finance        10000      8000
Hr              6000      5000
It              7000      7000

In [73]:
max= df.groupby('Department')['Salary'].agg(['min', 'max', 'mean']).reset_index()
max

  Department   min    max          mean
0    Finance  8000  20000  12666.666667
1         Hr  5000   6000   5500.000000
2         It  7000   7000   7000.000000

In [74]:
data =  {
'Department': ['Hr', 'Hr', 'It', 'Finance', 'Finance', 'Finance'],
'Employee': ['Alice', 'Bob', 'Charlie', 'Josh','Ali', 'jOHN'],
'Salary': [5000,  6000, 7000, 8000, 10000, 20000],
'Bonus': [2200,2000, 2323,3432,343423,43432]
}
df = pd.DataFrame(data)
df

  Department Employee  Salary   Bonus
0         Hr    Alice    5000    2200
1         Hr      Bob    6000    2000
2         It  Charlie    7000    2323
3    Finance     Josh    8000    3432
4    Finance      Ali   10000  343423
5    Finance     jOHN   20000   43432

In [77]:
df.groupby('Department')[['Salary', 'Bonus']].agg(['max', 'min'])

           Salary         Bonus
              max   min     max   min
Department
Finance     20000  8000  343423  3432
Hr           6000  5000    2200  2000
It           7000  7000    2323  2323

In [79]:
'_'.join('a','b','c','d')

TypeError: str.join() takes exactly one argument (4 given)

**apply**

In [80]:
df

  Department Employee  Salary   Bonus
0         Hr    Alice    5000    2200
1         Hr      Bob    6000    2000
2         It  Charlie    7000    2323
3    Finance     Josh    8000    3432
4    Finance      Ali   10000  343423
5    Finance     jOHN   20000   43432

In [ ]:
 
df.apply(lambda x: x*2)

       Department        Employee  Salary   Bonus
0            HrHr      AliceAlice   10000    4400
1            HrHr          BobBob   12000    4000
2            ItIt  CharlieCharlie   14000    4646
3  FinanceFinance        JoshJosh   16000    6864
4  FinanceFinance          AliAli   20000  686846
5  FinanceFinance        jOHNjOHN   40000   86864

In [88]:
def debug(x):
    display(x)
    print('-'*50)
debug(data)

{'Department': ['Hr', 'Hr', 'It', 'Finance', 'Finance', 'Finance'],
 'Employee': ['Alice', 'Bob', 'Charlie', 'Josh', 'Ali', 'jOHN'],
 'Salary': [5000, 6000, 7000, 8000, 10000, 20000],
 'Bonus': [2200, 2000, 2323, 3432, 343423, 43432]}

--------------------------------------------------

In [89]:
df['NamewithSalary'] = df.apply(lambda x: x['Employee'] + '-' + str(x['Salary']), axis=1)

In [90]:
df

  Department Employee  Salary   Bonus NamewithSalary
0         Hr    Alice    5000    2200     Alice-5000
1         Hr      Bob    6000    2000       Bob-6000
2         It  Charlie    7000    2323   Charlie-7000
3    Finance     Josh    8000    3432      Josh-8000
4    Finance      Ali   10000  343423      Ali-10000
5    Finance     jOHN   20000   43432     jOHN-20000

In [93]:
df.set_index('Employee')

         Department  Salary   Bonus NamewithSalary
Employee
Alice            Hr    5000    2200     Alice-5000
Bob              Hr    6000    2000       Bob-6000
Charlie          It    7000    2323   Charlie-7000
Josh        Finance    8000    3432      Josh-8000
Ali         Finance   10000  343423      Ali-10000
jOHN        Finance   20000   43432     jOHN-20000

In [98]:
df.drop('NamewithSalary', axis=1, inplace=True)

In [99]:
df

  Department Employee  Salary   Bonus
0         Hr    Alice    5000    2200
1         Hr      Bob    6000    2000
2         It  Charlie    7000    2323
3    Finance     Josh    8000    3432
4    Finance      Ali   10000  343423
5    Finance     jOHN   20000   43432

In [102]:
def debug(x):
    print(type(x))
    print(x)
    print('-'*50)
    return x
# df.map(demo)

In [103]:
# 
# 
#

**pipe**

In [110]:
def add_column(df, col_name:str, value:int):
    df(col_name) = value
    return df
df.pipe(add_column, 'my_new_col', 10)

SyntaxError: cannot assign to function call here. Maybe you meant '==' instead of '='? (4152515026.py, line 2)

In [115]:
print("hello")

hello

### Muhammadyusuf

**apply**

In [116]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Department': ['HR', 'Tech', 'Tech', 'HR', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [70, 90, 85, 75, 80]
})

# Multiple aggregations
agg_results = df.groupby('Department')['Salary'].agg(['mean', 'max', 'min', 'std'])
print(agg_results)

# Custom aggregation
def salary_range(series):
    return series.max() - series.min()

print(df.groupby('Department')['Salary'].apply(salary_range))

            mean  max  min       std
Department
Finance     80.0   80   80       NaN
HR          72.5   75   70  3.535534
Tech        87.5   90   85  3.535534
Department
Finance    0
HR         5
Tech       5
Name: Salary, dtype: int64